conf/src/InformationRegisters/ЭП_ЭффективностьСотрудников/ЭП_ЭффективностьСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ЭффективностьСотрудников</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрофильРасчета</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_ПрофилиРасчетаРезультативности/ЭП_ПрофилиРасчетаРезультативности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_ПрофилиРасчетаРезультативности</name>
  <owners>Catalog.ЭП_ГруппыРасчетныхПрофилей</owners>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПорог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПорог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехническаяПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесовойКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевоеЗначение</name>
      <type>
        <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособАгрегации</name>
      <type>
        <types>EnumRef.ЭП_СпособыАгрегации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/CommonForms/ЭП_ВиджетОценкиПоПрофилю/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьРеквизиты();
	
КонецПроцедуры 

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьИнформацию();
	ОбновитьРеквизиты();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьИнформацию()
	
	ОценкиОтсутствуют = Истина;
	НадписьОтсутствияОценок = "Нет оценок по профилю";
	НадписьПрисутствияОценок = "Оценка за текущий период выставлена";
	
	Сотрудник = ПолучитьСотрудникаПоТекущемуПользователю();
	
	РезультатЗапросаПрофилиПользователя = ПолучитьПрофилиТекущегоПользователя(Сотрудник);
	
	Если РезультатЗапросаПрофилиПользователя.Пустой() Тогда
		НадписьОтсутствияОценок = "Не назначен профиль, обратитесь к Германову В.С.";
		Профили = "";
		ОценкиОтсутствуют = Истина;
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ПолучитьДанныеОбОценках(Сотрудник); 
	
	Если РезультатЗапроса.Пустой() Тогда
		ОценкиОтсутствуют = Ложь;
	Иначе
		ОценкиОтсутствуют = Истина;
		ПрофилиСтрока = "Профили: ";
		
		УникальныеПрофили = РезультатЗапроса.Выгрузить();
		УникальныеПрофили.Свернуть("ПрофильПредставление");
		УникальныеПрофили = УникальныеПрофили.ВыгрузитьКолонку("ПрофильПредставление");
		
		Профили = ПрофилиСтрока + СтрСоединить(УникальныеПрофили, ", ");
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеОбОценках(Сотрудник)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_СотрудникиРасчетныеПрофили.Профиль КАК Профиль
	|ПОМЕСТИТЬ втПрофилиСотрудника
	|ИЗ
	|	Справочник.ЭП_Сотрудники.РасчетныеПрофили КАК ЭП_СотрудникиРасчетныеПрофили
	|ГДЕ
	|	ЭП_СотрудникиРасчетныеПрофили.Ссылка = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭП_ПрофилиРасчетаРезультативностиПоказатели.Показатель КАК Показатель,
	|	втПрофилиСотрудника.Профиль КАК Профиль
	|ПОМЕСТИТЬ втПоказатели
	|ИЗ
	|	втПрофилиСотрудника КАК втПрофилиСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_ПрофилиРасчетаРезультативности.Показатели КАК ЭП_ПрофилиРасчетаРезультативностиПоказатели
	|		ПО втПрофилиСотрудника.Профиль = ЭП_ПрофилиРасчетаРезультативностиПоказатели.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭП_ЭффективностьСотрудников.Сотрудник КАК Сотрудник,
	|	ЭП_ЭффективностьСотрудников.ПрофильРасчета.Представление КАК ПрофильПредставление,
	|	ЭП_ЭффективностьСотрудников.ПрофильРасчета КАК ПрофильРасчета,
	|	ЭП_ЭффективностьСотрудников.Показатель КАК Показатель
	|ПОМЕСТИТЬ втРегистрЗаписиПоСотруднику
	|ИЗ
	|	РегистрСведений.ЭП_ЭффективностьСотрудников КАК ЭП_ЭффективностьСотрудников
	|ГДЕ
	|	ЭП_ЭффективностьСотрудников.ПериодОценивания МЕЖДУ &Начало И &Конец
	|	И ЭП_ЭффективностьСотрудников.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоказатели.Профиль КАК Профиль,
	|	втПоказатели.Показатель КАК Показатель,
	|	втПоказатели.Профиль.Представление КАК ПрофильПредставление
	|ИЗ
	|	втПоказатели КАК втПоказатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРегистрЗаписиПоСотруднику КАК втРегистрЗаписиПоСотруднику
	|		ПО втПоказатели.Профиль = втРегистрЗаписиПоСотруднику.ПрофильРасчета
	|			И втПоказатели.Показатель = втРегистрЗаписиПоСотруднику.Показатель
	|ГДЕ
	|	втРегистрЗаписиПоСотруднику.ПрофильРасчета ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Начало", НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
	Запрос.УстановитьПараметр("Конец", КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Функция ПолучитьПрофилиТекущегоПользователя(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_СотрудникиРасчетныеПрофили.Профиль.Представление КАК ПрофильПредставление
	|ИЗ
	|	Справочник.ЭП_Сотрудники.РасчетныеПрофили КАК ЭП_СотрудникиРасчетныеПрофили
	|ГДЕ
	|	ЭП_СотрудникиРасчетныеПрофили.Ссылка = &ТекущийСотрудник";
	
	Запрос.УстановитьПараметр("ТекущийСотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере 
Функция ПолучитьСотрудникаПоТекущемуПользователю()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.ЭП_Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Сотрудник;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьРеквизиты()
	
	Если ОценкиОтсутствуют Тогда 
		Элементы.НадписьОтсутствияОценок.Видимость = Истина;
		Элементы.НадписьПрисутствияОценок.Видимость = Ложь;
		Элементы.Профили.Видимость = Истина;
	Иначе
		Элементы.НадписьОтсутствияОценок.Видимость = Ложь; 
		Элементы.НадписьПрисутствияОценок.Видимость = Истина;
		Элементы.Профили.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
